Show / Hide Table of Contents
Class CombiItem
Combi item
Inheritance
System.Object
OpenObject
CombiItem
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Loading.CombiItem")]
public class CombiItem : OpenObject
Constructors
Improve this Doc   View Source
CombiItem()
Constructor
Declaration
public CombiItem()
Properties
Improve this Doc   View Source
Coeff
Coefficient
Declaration
public double Coeff { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Combination
Inserted another combination
Declaration
public ReferenceElement Combination { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
Id
Id of CombiItem
Declaration
public int Id { get; set; }
Property Value
 Type |  Description
 System.Int32
Improve this Doc   View Source
LoadCase
Load case
Declaration
public ReferenceElement LoadCase { get; set; }
Property Value
 Type |  Description
 ReferenceElement
 Improve this Doc
 View Source